import { atom } from "recoil";

export const diaryContent = atom({
  key: "DIARY/content",
  default: {
    "2022-01-08": {
      content: ["세계관 공개"],
    },
    "2022-01-15": {
      content: ["세계관 공개", "2차 홍보"],
    },
    "2022-01-16": {
      content: ["스킬 및 시스템 공개"],
    },
    "2022-01-22": {
      content: ["mpc 공개", "QnA 접수"],
    },
    "2022-01-26": {
      content: ["신청서 접수 시작"],
    },
    "2022-01-27": {
      content: [""],
    },
    "2022-01-28": {
      content: [""],
    },
    "2022-01-29": {
      content: [""],
    },
    "2022-01-30": {
      content: [""],
    },
    "2022-01-31": {
      content: [""],
    },
    "2022-02-01": {
      content: [""],
    },
    "2022-02-02": {
      content: [""],
    },
    "2022-02-03": {
      content: [""],
    },
    "2022-02-04": {
      content: ["합격자 발표"],
    },
    "2022-02-05": {
      color: ["yellow"],
      content: ["텍관 조율"],
    },
    "2022-02-06": {
      content: ["텍관 조율", "개장"],
    },
    "2022-02-12": {
      content: ["모의 레이드", "개장"],
    },
    "2022-02-13": {
      content: ["1주차 종료"],
    },
    "2022-02-14": {
      content: ["리뉴얼"],
    },
    "2022-02-15": {
      content: [""],
    },
    "2022-02-16": {
      content: [""],
    },
    "2022-02-17": {
      content: ["마감"],
    },
    "2022-02-18": {
      content: ["2부 시작"],
    },
    "2022-03-05": {
      content: ["마무리 레이드"],
    },
    "2022-03-06": {
      content: ["2부 종료"],
    },
    "2022-03-11": {
      content: ["3부 개장"],
    },
    "2022-03-26": {
      content: ["마무리 레이드"],
    },
    "2022-03-27": {
      content: ["3부 종료"],
    },
    "2022-03-28": {
      content: ["리뉴얼"],
    },
    "2022-03-29": {
      content: [""],
    },
    "2022-03-30": {
      content: [""],
    },
    "2022-03-31": {
      content: ["리뉴얼 마감"],
    },
    "2022-04-01": {
      content: ["4부 개장"],
    },
    "2022-04-02": {
      content: ["조사"],
    },
    "2022-04-03": {
      content: ["스토리 진행"],
    },
    "2022-04-05": {
      content: ["세미 조사"],
    },
    "2022-04-07": {
      content: ["4부 개장"],
    },
    "2022-04-08": {
      content: ["조사"],
    },
    "2022-04-09": {
      content: ["세미 레이드 "],
    },
    "2022-04-10": {
      content: ["스토리 진행"],
    },
    "2022-04-12": {
      content: ["조시"],
    },
    "2022-04-14": {
      content: ["조사"],
    },
    "2022-04-15": {
      content: ["스토리 진행"],
    },
    "2022-04-16": {
      content: ["마지막 레이드"],
    },
    "2022-04-17": {
      content: ["엔딩"],
    },
  },
});
